app/controllers/photospaces_controller.rb

SELECT * FROM "photospaces" WHERE ((photospaces.komentarz LIKE '%kobzar%') AND (photospaces.autor LIKE '%kobzar%'))
---
  def index
    @photospaces = Photospace.all

SELECT * FROM "photospaces" WHERE (photospaces.autor LIKE '%aaasd%')
---
  def show
    @photospace = Photospace.find(params[:id])

SELECT * FROM "photospaces" WHERE ("photospaces"."id" = 5)
---
  def edit
    @photospace = Photospace.find(params[:id])

INSERT INTO "photospaces" ("created_at", "photo_file_size", "autor", "updated_at", "photo_file_name", "photo_content_type", "komentarz", "kategoria_id") VALUES('2010-01-09 18:42:27', 13344, 'Admin', '2010-01-09 18:42:27', 'herb.png', 'image/png', 'Herb Elblaga', 8)
---
  def create
    @photospace = Photospace.new(params[:photospace])

    respond_to do |format|
      if @photospace.save

SELECT * FROM "photospaces" WHERE ("photospaces"."id" = 5)
UPDATE "photospaces" SET "updated_at" = '2010-01-06 11:36:21', "created_at" = '2010-01-06 10:45:36', "autor" = 'olga', "photo_file_name" = 'webspik.gif', "photo_file_size" = 1821, "komentarz" = 'to jest bardzo fajne zdjęcie', "photo_content_type" = 'image/gif' WHERE "id" = 15
---
  def update
    @photospace = Photospace.find(params[:id])

    respond_to do |format|
      if @photospace.update_attributes(params[:photospace])

SELECT * FROM "photospaces" WHERE ("photospaces"."id" = 1)
DELETE FROM "photospaces" WHERE "id" = 1
---
  def destroy
    @photospace = Photospace.find(params[:id])
    @photospace.destroy