app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_request_at", "created_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES(NULL, '2009-12-31 12:04:18', 'e8dd285c2961abecbbabff4bb52fa46cfa6a7abc2074753468c8642e180374de17bea772456ea647a0af567e32174252689a227a80a74f16ca779cadce056ce7', '2009-12-31 12:04:18', NULL, 'uTnY70PLxnJT3aMz26pj', NULL, '30722f13ac3fac7cbebb333f2789ab542567b3857c8efcc2cf10c32144d2f451035c694b8572ac535201f9987fd3d9c4f5ea3fbffaf60fd4080913d7b106c1f2', 0, NULL, 'user', NULL, 'user@wr.com')