app/controllers/wpisy_controller.rb

SELECT * FROM "photospaces" WHERE ("photospaces"."id" = 15)
INSERT INTO "wpisy" ("podpis", "created_at", "body", "updated_at", "photospace_id") VALUES('gfhf', '2010-01-09 03:32:32', 'ffff', '2010-01-09 03:32:32', NULL)
---
def create
   @photospace = Photospace.find(params[:photospace_id])
   @wpis = @photospace.wpisy.create!(params[:wpis])